13/data/attachments/6bac2fcbf3bc7f59.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Leonard_second_Friend_43256_3</nif:username>
            <nif:friendToBeRequested>soap_friends_b5d7f9db-59ba-4d4d-950e-6cab5b1206f6</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>